In [1]:
import os
os.listdir()

['.ipynb_checkpoints',
 '0I6U0N56BVTVGY24EM2FARBNIC.m3u8_in=5ca307641ef252bfd06e3224bedaa7e1__36b885d9f3c4f5ff1fdf59bc906367c9__1747474221__ni',
 '22-47_U1_IDS-3[1].pptx',
 '23891A67B2 (2).pdf',
 '23891A67B2.c',
 '23891A67B2.pdf',
 '2pics.docx',
 '2pics.pdf',
 '3.Employee Management System – Sort Employees by Salary using Quick Sort.pptx',
 '3.Employee Management System – Sort Employees by Salary using Quick Sort[1].pptx',
 '35afbd3360e0696aa99a45febea95f28.jpg',
 '5 Sports-Tournament-Scheduler-Efficient-Match-Scheduling-Using-Divide-and-Conquer[2].pptx',
 '79-ADA[1].pptx',
 '8033_3_8019429_1748001786_AWS Course Completion Certificate.pdf',
 '947037.jpg',
 'A2 De unit 5 Project Report.docx.docx',
 'Aadhaar.jpg',
 'ADA-A3[1][1].pptx',
 'AI_Agents_Report_PageNumbers_Centered.docx',
 'AI_Powered_Collections_Strategy.pptx',
 'Akula_Anjana_Internship_report[1].docx',
 'allotment.pdf',
 'Anaconda3-2025.06-0-Windows-x86_64.exe',
 'apache-tomcat-9.0.104.exe',
 'app.py',
 'archive',
 'archive (1).zip',
 'archive (2)',
 'archive (2).zip',
 'archive.zip',
 'Asian Paints Demand analysis project.pdf',
 'Bank Passbook.jpg',
 'Beige Brown and Yellow Modern Labor Day Instagram Post (2).png',
 'Benefits of the Solution - visual selection.png',
 'Bhasha_Bandhu_Sample_presentation_2.pptx',
 'birthday',
 'Bonafide.jpg',
 'Certificate.pdf',
 'ChatGPT Image Nov 5, 2025, 06_54_12 PM.png',
 'ChromeSetup.exe',
 'Cleaned_Employee_Management_System.pptx',
 'CN PDF (1).pdf',
 'CN QUESTION BANK 10-11-2025.pdf',
 'CN.pdf',
 'COBRA TECH PPT.key',
 'COBRA TECH.pdf',
 'codeblocks-20.03mingw-setup.exe',
 'colab.txt',
 'college Bonafide.jpg',
 'comet_installer_latest.exe',
 'customserver.js',
 'DBMS3.docx',
 'DBMS3.pdf',
 'de 3.docx',
 'De unit 5 Project Report.docx',
 'Desktop',
 'desktop.ini',
 'DM assessment unit 1.pdf',
 'DM assessment unit 2.pdf',
 'DocScanner 18-Sept-2025 1-23\u202fpm.pdf',
 'Documents',
 'download.pdf',
 'DS Unit-V.pdf',
 'DS-PROJECT-5.docx',
 'Duality_AI_PPT.pptx',
 'EAadhaar_0013380190154820251013100903_30112025185712.pdf',
 'eclipse-inst-jre-win64.exe',
 'eclipse-java-luna-SR2-win32-x86_64',
 'eclipse-jee-2023-06-R-win32-x86_64',
 'eclipse-jee-2023-06-R-win32-x86_64.zip',
 'EDA_Example_Answer.docx',
 'example_answer_pptx.pptx',
 'exp 4[1].docx',
 'exp 5.pdf',
 'exp 5[1].docx',
 'Exp-8 R-Programming[1].docx',
 'Exp-9 R Programming[1].docx',
 'exp5_dataset.csv',
 'EXPERIMENT 1.docx',
 'Experiment5_Output.pdf',
 'exp_4[1].docx',
 'FindFactorial.java',
 'flutter (1).pdf',
 'food_delivery_analysis.ipynb',
 'FULL ADDER.circ',
 'Geldium_Delinquency_Model_Plan.pdf',
 'Gemini_Generated_Image_55rsqf55rsqf55rs.png',
 'Gemini_Generated_Image_qcje6uqcje6uqcje.png',
 'Gemini_Generated_Image_qdtjmmqdtjmmqdtj.png',
 'govt3.png',
 'GuviCertification - 87lZ7190Ng667nfH2K.pdf',
 'HawkinsDB Publishing Paper  .docx',
 'hell.R',
 'hexavortex.png',
 'hey.html',
 'Idea_Submission_Deck___i.Mobilothon_5.0[1].pptx',
 'IDS-PROJECT BASED QUESTION BANK III-I CSE(DS) & AI&DS.doc',
 'IDS.docx',
 'Image-Processing-Accelerator-Matrix-Multiplication-Using-Strassens-Algorithm[1].pptx',
 'IMG_0016.png',
 'IMG_7091.MOV',
 'InCoinPay.apk',
 'Inspecting-and-Classifying-Data-Types-in-R.pptx',
 'Internship-Journey (1).pptx',
 'IntrotoDataScienceUpdate20250805-30-j7pniw.pdf',
 'InventorySystem.java',
 'jdk-8u201-windows-x64.exe',
 'kafka_2.12-3.7.2',
 'kafka_2.12-3.7.2.tgz',
 'logical.circ',
 'logisim-win-2.7.1.exe',
 'marvels-spider-man-pc-4k-jf-1920x1080.jpg',
 'Maths Unit-1.pdf',
 'Maths Unit-2.pdf',
 'Md_Parvez_Resume.docx',
 'Medicalprescription.zip',
 'Merge sort.pptx',
 'Methodology and process for implementation - visual selection (1).png',
 'Methodology and process for implementation - visual selection.png',
 'MyXvBcppsW2FkNYCX_ifobHAoMjQs9s6bKS_wti4zzLB2MSxgjWEA_1754582592456_completion_certificate.pdf',
 'node-v22.13.1-x64.msi',
 'ns-allinone-2.35.tar.gz',
 'NSG2.1.jar',
 'Odd_Data_Out_QA_Extended (1).pptx',
 'ojdbc6-12.1.0.1-atlassian-hosted.jar',
 'Online_Blood_Bank_System.docx',
 'Online_Blood_Bank_System.pdf',
 'Oracle_JDK-23',
 'orders.csv',
 'OS -1.docx',
 'os-unit3.docx',
 'Panchakarma_SIH2025_PPT.pptx',
 'passwor manager.c',
 'pics.docx',
 'Postman-win64-Setup.exe',
 'Pranitha_Resume.docx',
 'processed-s-c03679fa61c8421fb97f180fca6a8532.mp4',
 'Product.java',
 'PROJECT REPORT.docx',
 'PROJECT_REPORT[2][1].pdf',
 'Promethean Posters - 08-04-2025 - With All Events (1).pdf',
 'python-3.12.7-amd64.exe',
 'python-3.13.7-amd64.exe',
 'question bank.docx',
 'R Pranitha_Resume.docx',
 'R-4.5.1-win.exe',
 'Read_Text.java',
 'Restaurant order management PPT.pdf',
 'Restaurant.zip',
 'restaurants.sql',
 'Restaurent.java',
 'ROUND-3.docx',
 'ROUND-3[1].docx',
 'Round5_GuessTheFuture.pptx',
 'Round_Robin_Scheduling_Report.docx',
 'RStudio-2025.05.1-513.exe',
 'RStudio_Screenshots_Grid.pdf',
 'R_partA.pdf',
 'safeher.r',
 'sample answer for one project problem from QB.pdf',
 'SE 2.docx',
 'SE-3.pdf',
 'SE-4.docx',
 'SEMINAR_REPORT_MANIA1.docx',
 'SIH2025-PranaTrack[1][1].pptx',
 'SimpleMsg.java',
 'smartbloodbank.png',
 'Sona.docx',
 'SpotifySetup.exe',
 'SQL create table student(sno number.txt',
 'Strategies for overcoming these challenges - visual selection.png',
 'student_marks_sorted_report.pdf',
 'Student_Trigger_Project_Documentation.docx',
 'swiggy.ipynb',
 'swiggy_cleaned.csv',
 'TableauPublicDesktop-64bit-2024-2-3.exe',
 'TECH SEMINAR REPORT[1] (1).pdf',
 'TECH SEMINAR REPORT[1].docx',
 'Technical seminar documentation.docx',
 'Technologies to be Used - visual selection.png',
 'Telugu_Songs_Quiz.pptx',
 'text.txt',
 'ubuntu-18.04.6-desktop-amd64.iso',
 'unit_3 befa-2.docx',
 'unstopsmarthire-2.2.0.exe',
 'users.json',
 'VirtualBox-6.1.32-149290-Win.exe',
 'Website (1)',
 'Website (1).zip',
 'WhatsApp Image 2025-02-27 at 21.10.07_75a333e8.jpg',
 'WhatsApp Image 2025-03-18 at 17.03.34_4243dd06.jpg',
 'WhatsApp Image 2025-08-12 at 19.48.37_3a4691ba.jpg',
 'WhatsApp Image 2026-01-24 at 2.45.51 PM.jpeg',
 'WP CODE.zip',
 'Wp project .docx',
 'WP-4.docx',
 'xampp-windows-x64-8.0.30-0-VS16-installer.exe',
 'Zoom_cm_fo42pnktZ9vvrZo4_m4XKD5uFsL6DPOl4nw1VDCs8fLoktPzZb7kg3@twwyxnzOwC7YrO30_kf3b5ed59f4990772_.exe']

In [2]:
import pandas as pd
import sqlite3

In [3]:
orders = pd.read_csv("orders.csv")
orders.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [4]:
users = pd.read_json("users.json")
users.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [8]:
conn = sqlite3.connect("restaurants.db")
cursor = conn.cursor()

# Drop table if it already exists
cursor.execute("DROP TABLE IF EXISTS restaurants")

with open("restaurants.sql", "r", encoding="utf-8") as f:
    sql_script = f.read()

cursor.executescript(sql_script)
conn.commit()

In [9]:
restaurants = pd.read_sql_query(
    "SELECT * FROM restaurants", conn
)

restaurants.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [10]:
orders_users = pd.merge(
    orders,
    users,
    on="user_id",
    how="left"
)

final_df = pd.merge(
    orders_users,
    restaurants,
    on="restaurant_id",
    how="left"
)

final_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [12]:
final_df.to_csv("final_food_delivery_dataset.csv", index=False)

In [18]:
final_df.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating'],
      dtype='object')

In [20]:
list(final_df.columns)

['order_id',
 'user_id',
 'restaurant_id',
 'order_date',
 'total_amount',
 'restaurant_name_x',
 'name',
 'city',
 'membership',
 'restaurant_name_y',
 'cuisine',
 'rating']

In [21]:
final_df[final_df['membership'] == 'Gold'] \
    .groupby('city')['total_amount'] \
    .sum() \
    .sort_values(ascending=False)

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [22]:
MEMBERSHIP_COL = 'membership'
AMOUNT_COL = 'total_amount'
CITY_COL = 'city'
USER_COL = 'user_id'
CUISINE_COL = 'cuisine'
RATING_COL = 'rating'
RESTAURANT_COL = 'restaurant_name'
DATE_COL = 'order_date'

In [23]:
final_df.groupby(CUISINE_COL)[AMOUNT_COL] \
    .mean() \
    .sort_values(ascending=False)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [24]:
final_df.groupby(USER_COL)[AMOUNT_COL] \
    .sum() \
    .loc[lambda x: x > 1000] \
    .count()

np.int64(2544)

In [25]:
final_df['rating_range'] = pd.cut(
    final_df[RATING_COL],
    bins=[3.0, 3.5, 4.0, 4.5, 5.0]
)

final_df.groupby('rating_range')[AMOUNT_COL] \
    .sum() \
    .sort_values(ascending=False)

C:\Users\rpran\AppData\Local\Temp\ipykernel_14536\2693199462.py:6: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  final_df.groupby('rating_range')[AMOUNT_COL] \

rating_range
(4.5, 5.0]    2197030.75
(4.0, 4.5]    1960326.26
(3.0, 3.5]    1881754.57
(3.5, 4.0]    1717494.41
Name: total_amount, dtype: float64

In [26]:
final_df[final_df[MEMBERSHIP_COL] == 'Gold'] \
    .groupby(CITY_COL)[AMOUNT_COL] \
    .mean() \
    .sort_values(ascending=False)

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

In [27]:
final_df.groupby(CUISINE_COL).agg(
    total_revenue=(AMOUNT_COL, 'sum'),
    restaurant_count=('restaurant_id', 'nunique')
).sort_values(['restaurant_count', 'total_revenue'],
              ascending=[True, False])

         total_revenue  restaurant_count
cuisine
Chinese     1930504.65               120
Italian     2024203.80               126
Indian      1971412.58               126
Mexican     2085503.09               128

In [30]:
list(final_df.columns)

['order_id',
 'user_id',
 'restaurant_id',
 'order_date',
 'total_amount',
 'restaurant_name_x',
 'name',
 'city',
 'membership',
 'restaurant_name_y',
 'cuisine',
 'rating',
 'rating_range']

In [33]:
final_df[final_df[MEMBERSHIP_COL] == 'Gold'].shape[0]

4987

In [28]:
round(
    (final_df[final_df[MEMBERSHIP_COL] == 'Gold'].shape[0]
     / final_df.shape[0]) * 100
)

50

In [34]:
round(
    final_df[final_df[CITY_COL] == 'Hyderabad'][AMOUNT_COL].sum()
)

1889367

In [35]:
final_df[USER_COL].nunique()

2883

In [36]:
final_df[final_df[RATING_COL] >= 4.5].shape[0]

3374

In [37]:
top_city = final_df[final_df[MEMBERSHIP_COL] == 'Gold'] \
    .groupby(CITY_COL)[AMOUNT_COL] \
    .sum() \
    .idxmax()

final_df[
    (final_df[MEMBERSHIP_COL] == 'Gold') &
    (final_df[CITY_COL] == top_city)
].shape[0]

1337

In [38]:
round(
    final_df[final_df[MEMBERSHIP_COL] == 'Gold'][AMOUNT_COL].mean(),
    2
)

np.float64(797.15)